### The code is to filter module BBB for studentRegistration.csv file

In [1]:
# Import pandas library
import pandas as pd

In [2]:
root_path = 'D:/Data Projects/Data Analyst Imperial College/Uploaded Doc'

In [3]:
# Create a dataframe and import data
df = pd.read_csv(f'{root_path}/OULAD_raw/studentRegistration.csv')
df.count()

code_module            32593
code_presentation      32593
id_student             32593
date_registration      32548
date_unregistration    10072
dtype: int64

In [4]:
# List values under the code_module to check modules
df.code_module.unique()

array(['AAA', 'BBB', 'CCC', 'DDD', 'EEE', 'FFF', 'GGG'], dtype=object)

In [5]:
# Have a general idea of the data
df.head()

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN

In [6]:
# Create BBB module file
df_BBB = df[df['code_module'] == 'BBB']
df_BBB.count()

code_module            7909
code_presentation      7909
id_student             7909
date_registration      7900
date_unregistration    2377
dtype: int64

In [7]:
# Show the cleansed data
df_BBB.head()

,code_module,code_presentation,id_student,date_registration,date_unregistration
748,BBB,2013B,23629,-47.0,NaN
749,BBB,2013B,25107,-73.0,NaN
750,BBB,2013B,27891,-58.0,153.0
751,BBB,2013B,29144,-24.0,NaN
752,BBB,2013B,31663,-60.0,NaN

In [8]:
# Save the filtered data to a new CSV file
df_BBB.to_csv(f'{root_path}/OULAD_BBB_clean/studentRegistration_BBB.csv', index=False)

In [9]:
# Save the filtered data to a new parquet file for Power BI
df_BBB.to_parquet(f'{root_path}/OULAD_BBB_clean/studentRegistration_BBB.parquet', index=False)